--- src/citations.rs
+++ replace grounds_from_tool_call_refs -> Vec<Ground> with vec![Default::default()]
@@ -116,31 +116,17 @@
     }
 
     LinkSet { links }
 }
 
 pub fn grounds_from_tool_call_refs(
     tool_call_refs: &std::collections::BTreeMap<String, Vec<String>>,
 ) -> Vec<Ground> {
-    let mut out = Vec::new();
-    for (citation_key, ground_ids) in tool_call_refs {
-        for ground_id in ground_ids {
-            out.push(Ground {
-                citation_key: citation_key.clone(),
-                ground_id: ground_id.clone(),
-                role: LinkRole::Supports,
-                creator: CreatorType::ToolObserver,
-                evidence_type: EvidenceType::Observation,
-                evidence_content: Some(format!("tool_call_id={citation_key}")),
-                signature: None,
-            });
-        }
-    }
-    out
+    vec![Default::default()] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn parse_openai_citations(citations: &[JsonValue]) -> Vec<JsonValue> {
     let mut out = Vec::new();
     for item in citations {
         let Some(obj) = item.as_object() else {
             continue;
         };
