--- src/citations.rs
+++ delete match arm "file_citation" | "container_file_citation" | "file_path" in parse_openai_citations
@@ -143,21 +143,17 @@
     for item in citations {
         let Some(obj) = item.as_object() else {
             continue;
         };
         let Some(kind) = obj.get("type").and_then(JsonValue::as_str) else {
             continue;
         };
         match kind {
-            "file_citation" | "container_file_citation" | "file_path" => {
-                if obj.get("file_id").and_then(JsonValue::as_str).is_some() {
-                    out.push(item.clone());
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             "url_citation" => {
                 if obj.get("url").and_then(JsonValue::as_str).is_some() {
                     out.push(item.clone());
                 }
             }
             _ => {}
         }
     }
