--- src/citations.rs
+++ delete match arm "url_citation" in parse_openai_citations
@@ -148,21 +148,17 @@
             continue;
         };
         match kind {
             "file_citation" | "container_file_citation" | "file_path" => {
                 if obj.get("file_id").and_then(JsonValue::as_str).is_some() {
                     out.push(item.clone());
                 }
             }
-            "url_citation" => {
-                if obj.get("url").and_then(JsonValue::as_str).is_some() {
-                    out.push(item.clone());
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {}
         }
     }
     out
 }
 
 pub fn grounds_from_openai_citations(citations: &[JsonValue]) -> Vec<Ground> {
     let mut grounds = Vec::new();
