--- src/citations.rs
+++ replace grounds_from_openai_citations -> Vec<Ground> with vec![]
@@ -160,32 +160,17 @@
             }
             _ => {}
         }
     }
     out
 }
 
 pub fn grounds_from_openai_citations(citations: &[JsonValue]) -> Vec<Ground> {
-    let mut grounds = Vec::new();
-    for citation in citations {
-        let Some(ground_id) = extract_ground_id(citation) else {
-            continue;
-        };
-        grounds.push(Ground {
-            citation_key: ground_id.clone(),
-            ground_id,
-            role: LinkRole::Supports,
-            creator: CreatorType::UpstreamPipeline,
-            evidence_type: EvidenceType::Observation,
-            evidence_content: Some("openai_citation".to_string()),
-            signature: None,
-        });
-    }
-    grounds
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn link_set_from_openai_citations(citations: &[JsonValue], statement_id: &str) -> LinkSet {
     let mut links = Vec::new();
     for (idx, citation) in citations.iter().enumerate() {
         let Some(ground_id) = extract_ground_id(citation) else {
             continue;
         };
