--- src/citations.rs
+++ replace extract_ground_id -> Option<String> with None
@@ -200,29 +200,17 @@
                 signature: None,
             },
         });
     }
     LinkSet { links }
 }
 
 fn extract_ground_id(citation: &JsonValue) -> Option<String> {
-    let obj = citation.as_object()?;
-    let kind = obj.get("type")?.as_str()?;
-    match kind {
-        "file_citation" | "container_file_citation" | "file_path" => obj
-            .get("file_id")
-            .and_then(JsonValue::as_str)
-            .map(ToString::to_string),
-        "url_citation" => obj
-            .get("url")
-            .and_then(JsonValue::as_str)
-            .map(ToString::to_string),
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn coerce_grounds_input(
     grounds_payload: Option<&[JsonValue]>,
     legacy_openai_citations: Option<&[JsonValue]>,
     _legacy_links: Option<&JsonValue>,
 ) -> Vec<Ground> {
     let mut normalized = Vec::new();
