--- src/citations.rs
+++ delete match arm "file_citation" | "container_file_citation" | "file_path" in extract_ground_id
@@ -203,20 +203,17 @@
     }
     LinkSet { links }
 }
 
 fn extract_ground_id(citation: &JsonValue) -> Option<String> {
     let obj = citation.as_object()?;
     let kind = obj.get("type")?.as_str()?;
     match kind {
-        "file_citation" | "container_file_citation" | "file_path" => obj
-            .get("file_id")
-            .and_then(JsonValue::as_str)
-            .map(ToString::to_string),
+         /* ~ changed by cargo-mutants ~ */
         "url_citation" => obj
             .get("url")
             .and_then(JsonValue::as_str)
             .map(ToString::to_string),
         _ => None,
     }
 }
 
