--- src/citations.rs
+++ replace coerce_grounds_input -> Vec<Ground> with vec![Default::default()]
@@ -220,34 +220,17 @@
     }
 }
 
 pub fn coerce_grounds_input(
     grounds_payload: Option<&[JsonValue]>,
     legacy_openai_citations: Option<&[JsonValue]>,
     _legacy_links: Option<&JsonValue>,
 ) -> Vec<Ground> {
-    let mut normalized = Vec::new();
-
-    if let Some(payload) = grounds_payload {
-        let explicit = parse_grounds(payload);
-        if !explicit.is_empty() {
-            normalized.extend(explicit);
-        } else {
-            let typed = parse_openai_citations(payload);
-            normalized.extend(grounds_from_openai_citations(&typed));
-        }
-    }
-
-    if let Some(citations) = legacy_openai_citations {
-        let typed = parse_openai_citations(citations);
-        normalized.extend(grounds_from_openai_citations(&typed));
-    }
-
-    normalized
+    vec![Default::default()] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::json::parse_json;
 
     #[test]
