--- src/citations.rs
+++ replace extract_citation_keys -> Vec<String> with vec![]
@@ -36,44 +36,17 @@
                 .and_then(JsonValue::as_str)
                 .map(ToString::to_string),
         });
     }
     grounds
 }
 
 pub fn extract_citation_keys(text: &str) -> Vec<String> {
-    if text.is_empty() {
-        return Vec::new();
-    }
-    let bytes = text.as_bytes();
-    let mut i = 0;
-    let mut keys = Vec::new();
-    let mut seen = HashSet::new();
-
-    while i + 2 < bytes.len() {
-        if bytes[i] == b'[' && bytes[i + 1] == b'@' {
-            let start = i + 2;
-            let mut end = start;
-            while end < bytes.len() && bytes[end] != b']' {
-                end += 1;
-            }
-            if end < bytes.len() && end > start {
-                let candidate = &text[start..end];
-                if is_valid_citation_key(candidate) && !seen.contains(candidate) {
-                    seen.insert(candidate.to_string());
-                    keys.push(candidate.to_string());
-                }
-            }
-            i = end;
-        }
-        i += 1;
-    }
-
-    keys
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_valid_citation_key(key: &str) -> bool {
     let mut chars = key.chars();
     let Some(first) = chars.next() else {
         return false;
     };
     if !first.is_ascii_alphabetic() {
