--- src/citations.rs
+++ replace + with * in extract_citation_keys
@@ -44,17 +44,17 @@
     if text.is_empty() {
         return Vec::new();
     }
     let bytes = text.as_bytes();
     let mut i = 0;
     let mut keys = Vec::new();
     let mut seen = HashSet::new();
 
-    while i + 2 < bytes.len() {
+    while i * /* ~ changed by cargo-mutants ~ */ 2 < bytes.len() {
         if bytes[i] == b'[' && bytes[i + 1] == b'@' {
             let start = i + 2;
             let mut end = start;
             while end < bytes.len() && bytes[end] != b']' {
                 end += 1;
             }
             if end < bytes.len() && end > start {
                 let candidate = &text[start..end];
