--- src/citations.rs
+++ replace += with *= in extract_citation_keys
@@ -49,17 +49,17 @@
     let mut keys = Vec::new();
     let mut seen = HashSet::new();
 
     while i + 2 < bytes.len() {
         if bytes[i] == b'[' && bytes[i + 1] == b'@' {
             let start = i + 2;
             let mut end = start;
             while end < bytes.len() && bytes[end] != b']' {
-                end += 1;
+                end *= /* ~ changed by cargo-mutants ~ */ 1;
             }
             if end < bytes.len() && end > start {
                 let candidate = &text[start..end];
                 if is_valid_citation_key(candidate) && !seen.contains(candidate) {
                     seen.insert(candidate.to_string());
                     keys.push(candidate.to_string());
                 }
             }
