--- src/citations.rs
+++ delete ! in extract_citation_keys
@@ -53,17 +53,17 @@
         if bytes[i] == b'[' && bytes[i + 1] == b'@' {
             let start = i + 2;
             let mut end = start;
             while end < bytes.len() && bytes[end] != b']' {
                 end += 1;
             }
             if end < bytes.len() && end > start {
                 let candidate = &text[start..end];
-                if is_valid_citation_key(candidate) && !seen.contains(candidate) {
+                if is_valid_citation_key(candidate) &&  /* ~ changed by cargo-mutants ~ */seen.contains(candidate) {
                     seen.insert(candidate.to_string());
                     keys.push(candidate.to_string());
                 }
             }
             i = end;
         }
         i += 1;
     }
