--- src/citations.rs
+++ replace += with -= in extract_citation_keys
@@ -60,17 +60,17 @@
                 let candidate = &text[start..end];
                 if is_valid_citation_key(candidate) && !seen.contains(candidate) {
                     seen.insert(candidate.to_string());
                     keys.push(candidate.to_string());
                 }
             }
             i = end;
         }
-        i += 1;
+        i -= /* ~ changed by cargo-mutants ~ */ 1;
     }
 
     keys
 }
 
 fn is_valid_citation_key(key: &str) -> bool {
     let mut chars = key.chars();
     let Some(first) = chars.next() else {
