--- src/citations.rs
+++ delete ! in is_valid_citation_key
@@ -71,17 +71,17 @@
     keys
 }
 
 fn is_valid_citation_key(key: &str) -> bool {
     let mut chars = key.chars();
     let Some(first) = chars.next() else {
         return false;
     };
-    if !first.is_ascii_alphabetic() {
+    if  /* ~ changed by cargo-mutants ~ */first.is_ascii_alphabetic() {
         return false;
     }
     chars.all(|c| c.is_ascii_alphanumeric() || c == '_' || c == '-')
 }
 
 pub fn build_links_from_grounds(text: &str, grounds: &[Ground], statement_id: &str) -> LinkSet {
     let mut by_key: BTreeMap<String, Vec<&Ground>> = BTreeMap::new();
     for ground in grounds {
