--- src/citations.rs
+++ replace == with != in is_valid_citation_key
@@ -74,17 +74,17 @@
 fn is_valid_citation_key(key: &str) -> bool {
     let mut chars = key.chars();
     let Some(first) = chars.next() else {
         return false;
     };
     if !first.is_ascii_alphabetic() {
         return false;
     }
-    chars.all(|c| c.is_ascii_alphanumeric() || c == '_' || c == '-')
+    chars.all(|c| c.is_ascii_alphanumeric() || c != /* ~ changed by cargo-mutants ~ */ '_' || c == '-')
 }
 
 pub fn build_links_from_grounds(text: &str, grounds: &[Ground], statement_id: &str) -> LinkSet {
     let mut by_key: BTreeMap<String, Vec<&Ground>> = BTreeMap::new();
     for ground in grounds {
         by_key
             .entry(ground.citation_key.clone())
             .or_default()
