--- src/citations.rs
+++ replace build_links_from_grounds -> LinkSet with Default::default()
@@ -78,49 +78,17 @@
     };
     if !first.is_ascii_alphabetic() {
         return false;
     }
     chars.all(|c| c.is_ascii_alphanumeric() || c == '_' || c == '-')
 }
 
 pub fn build_links_from_grounds(text: &str, grounds: &[Ground], statement_id: &str) -> LinkSet {
-    let mut by_key: BTreeMap<String, Vec<&Ground>> = BTreeMap::new();
-    for ground in grounds {
-        by_key
-            .entry(ground.citation_key.clone())
-            .or_default()
-            .push(ground);
-    }
-
-    let mut links = Vec::new();
-    for key in extract_citation_keys(text) {
-        if let Some(list) = by_key.get(&key) {
-            for ground in list {
-                links.push(StatementGroundLink {
-                    statement_id: statement_id.to_string(),
-                    ground_id: ground.ground_id.clone(),
-                    role: ground.role.clone(),
-                    provenance: Provenance {
-                        creator: ground.creator.clone(),
-                        evidence_type: ground.evidence_type.clone(),
-                        evidence_content: Some(
-                            ground
-                                .evidence_content
-                                .clone()
-                                .unwrap_or_else(|| format!("citation_key={key}")),
-                        ),
-                        signature: ground.signature.clone(),
-                    },
-                });
-            }
-        }
-    }
-
-    LinkSet { links }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn grounds_from_tool_call_refs(
     tool_call_refs: &std::collections::BTreeMap<String, Vec<String>>,
 ) -> Vec<Ground> {
     let mut out = Vec::new();
     for (citation_key, ground_ids) in tool_call_refs {
         for ground_id in ground_ids {
