--- src/evaluator.rs
+++ delete match arm Some(JsonValue::Array(arr)) in evaluate_from_json
@@ -100,17 +100,17 @@
         .ok_or_else(|| EvaluateError::InvalidJson("payload must be object".to_string()))?;
 
     let agent_output = obj
         .get("agent_output")
         .and_then(JsonValue::as_str)
         .map(ToString::to_string);
 
     let conversation = match obj.get("conversation") {
-        Some(JsonValue::Array(arr)) => Some(parse_conversation(arr)?),
+         /* ~ changed by cargo-mutants ~ */
         Some(JsonValue::Null) | None => None,
         _ => {
             return Err(EvaluateError::InvalidJson(
                 "conversation must be an array".to_string(),
             ));
         }
     };
 
