--- src/evaluator.rs
+++ delete match arm Some(JsonValue::Array(arr)) in evaluate_from_json
@@ -110,17 +110,17 @@
         _ => {
             return Err(EvaluateError::InvalidJson(
                 "conversation must be an array".to_string(),
             ));
         }
     };
 
     let grounds = match obj.get("grounds") {
-        Some(JsonValue::Array(arr)) => Some(coerce_grounds_input(Some(arr), None, None)),
+         /* ~ changed by cargo-mutants ~ */
         Some(JsonValue::Null) | None => None,
         _ => {
             return Err(EvaluateError::InvalidJson(
                 "grounds must be an array".to_string(),
             ));
         }
     };
 
