--- src/evaluator.rs
+++ replace parse_conversation -> Result<Vec<ConversationMessage>, EvaluateError> with Ok(vec![Default::default()])
@@ -129,50 +129,17 @@
         conversation,
         grounds,
     })
 }
 
 pub fn parse_conversation(
     messages: &[JsonValue],
 ) -> Result<Vec<ConversationMessage>, EvaluateError> {
-    let mut out = Vec::new();
-    for msg in messages {
-        let obj = msg
-            .as_object()
-            .ok_or_else(|| EvaluateError::InvalidMessage("message must be object".to_string()))?;
-        let role = obj
-            .get("role")
-            .and_then(JsonValue::as_str)
-            .ok_or_else(|| EvaluateError::InvalidMessage("message.role is required".to_string()))?
-            .to_string();
-
-        let content = obj.get("content").cloned();
-
-        let tool_call_id = obj
-            .get("tool_call_id")
-            .and_then(JsonValue::as_str)
-            .map(ToString::to_string);
-
-        let function_name = obj
-            .get("name")
-            .and_then(JsonValue::as_str)
-            .map(ToString::to_string);
-
-        let tool_calls = parse_tool_calls(obj.get("tool_calls"))?;
-
-        out.push(ConversationMessage {
-            role,
-            content,
-            tool_call_id,
-            tool_calls,
-            function_name,
-        });
-    }
-    Ok(out)
+    Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_tool_calls(value: Option<&JsonValue>) -> Result<Vec<ToolCall>, EvaluateError> {
     let Some(value) = value else {
         return Ok(Vec::new());
     };
     let Some(arr) = value.as_array() else {
         return Err(EvaluateError::InvalidMessage(
