--- src/evaluator.rs
+++ replace AdmissibilityEvaluator::evaluate_message -> Result<AdmissibilityJudgment, EvaluateError> with Ok(Default::default())
@@ -258,48 +258,17 @@
     }
 
     pub fn evaluate_message(
         &self,
         agent_message: &ConversationMessage,
         trajectory: &[ConversationMessage],
         grounds: Vec<Ground>,
     ) -> Result<AdmissibilityJudgment, EvaluateError> {
-        let tool_results = self.extract_tool_results(trajectory)?;
-        let (mut knowledge_nodes, tool_call_refs) =
-            self.knowledge_builder.build_with_references(&tool_results);
-
-        let speech_act = self.to_speech_act(agent_message)?;
-
-        knowledge_nodes = self
-            .knowledge_builder
-            .materialize_external_grounds(&knowledge_nodes, &grounds);
-
-        let mut combined_grounds = grounds;
-        combined_grounds.extend(grounds_from_tool_call_refs(&tool_call_refs));
-
-        let statement_id = "final_response";
-        let text = speech_act.text;
-
-        let links = build_links_from_grounds(&text, &combined_grounds, statement_id);
-        let accepted_ground_ids: BTreeSet<String> = combined_grounds
-            .iter()
-            .map(|ground| ground.ground_id.clone())
-            .collect();
-        let cited_ground_ids: BTreeSet<String> = links
-            .links
-            .iter()
-            .map(|link| link.ground_id.clone())
-            .collect();
-
-        let mut internal_result = self.evaluate_core(&text, &knowledge_nodes, Some(&links));
-        internal_result.grounds_accepted = accepted_ground_ids.len();
-        internal_result.grounds_cited = cited_ground_ids.len();
-
-        Ok(self.to_judgment(internal_result))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn evaluate_core(
         &self,
         agent_output: &str,
         knowledge_nodes: &[KnowledgeNode],
         links: Option<&LinkSet>,
     ) -> ValidationResult {
