--- src/evaluator.rs
+++ replace AdmissibilityEvaluator::evaluate_core -> ValidationResult with Default::default()
@@ -298,82 +298,17 @@
     }
 
     pub fn evaluate_core(
         &self,
         agent_output: &str,
         knowledge_nodes: &[KnowledgeNode],
         links: Option<&LinkSet>,
     ) -> ValidationResult {
-        if agent_output.is_empty() {
-            return ValidationResult {
-                status: EvaluationStatus::Underdetermined,
-                licensed: false,
-                can_retry: false,
-                feedback_hint: None,
-                violated_axioms: vec![],
-                statement_results: vec![],
-                explanation: "No content to validate".to_string(),
-                num_statements: 0,
-                num_acceptable: 0,
-                grounds_accepted: 0,
-                grounds_cited: 0,
-            };
-        }
-
-        let mut statements = self.extractor.extract(agent_output);
-        if statements.is_empty() {
-            return ValidationResult {
-                status: EvaluationStatus::NoNormativeContent,
-                licensed: false,
-                can_retry: false,
-                feedback_hint: None,
-                violated_axioms: vec![],
-                statement_results: vec![],
-                explanation:
-                    "Protocol-only output (greetings/offers) - no normative claims to evaluate"
-                        .to_string(),
-                num_statements: 0,
-                num_acceptable: 0,
-                grounds_accepted: 0,
-                grounds_cited: 0,
-            };
-        }
-
-        let mut statement_results = Vec::new();
-        let mut axiom_results = Vec::new();
-
-        for statement in &mut statements {
-            self.modality_detector.detect_with_conditions(statement);
-            let ground_set = self.ground_matcher.match_nodes(statement, knowledge_nodes);
-
-            let license = if statement.modality == Some(Modality::Descriptive) {
-                License {
-                    permitted_modalities: BTreeSet::new(),
-                }
-            } else {
-                self.license_deriver.derive(&ground_set, links)
-            };
-
-            let result =
-                self.axiom_checker
-                    .check(statement, &license, &ground_set, "task completion");
-            axiom_results.push(result.clone());
-
-            statement_results.push(StatementValidationResult {
-                statement: statement.clone(),
-                status: result.status,
-                license,
-                ground_set,
-                violated_axiom: result.violated_axiom,
-                explanation: result.explanation,
-            });
-        }
-
-        self.aggregate(&axiom_results, &statement_results)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn aggregate(
         &self,
         axiom_results: &[crate::normative::AxiomCheckResult],
         statement_results: &[StatementValidationResult],
     ) -> ValidationResult {
         let violations: Vec<String> = axiom_results
