--- src/evaluator.rs
+++ replace == with != in AdmissibilityEvaluator::evaluate_core
@@ -340,17 +340,17 @@
 
         let mut statement_results = Vec::new();
         let mut axiom_results = Vec::new();
 
         for statement in &mut statements {
             self.modality_detector.detect_with_conditions(statement);
             let ground_set = self.ground_matcher.match_nodes(statement, knowledge_nodes);
 
-            let license = if statement.modality == Some(Modality::Descriptive) {
+            let license = if statement.modality != /* ~ changed by cargo-mutants ~ */ Some(Modality::Descriptive) {
                 License {
                     permitted_modalities: BTreeSet::new(),
                 }
             } else {
                 self.license_deriver.derive(&ground_set, links)
             };
 
             let result =
