--- src/evaluator.rs
+++ replace == with != in AdmissibilityEvaluator::aggregate
@@ -378,17 +378,17 @@
     ) -> ValidationResult {
         let violations: Vec<String> = axiom_results
             .iter()
             .filter_map(|r| r.violated_axiom.clone())
             .collect();
 
         let (status, licensed, can_retry, feedback_hint, explanation) = if axiom_results
             .iter()
-            .any(|r| r.status == EvaluationStatus::ViolatesNorm)
+            .any(|r| r.status != /* ~ changed by cargo-mutants ~ */ EvaluationStatus::ViolatesNorm)
         {
             (
                 EvaluationStatus::ViolatesNorm,
                 false,
                 true,
                 Some(format!(
                     "Your response violates normative axioms: {}. Please revise or refuse to answer if you lack required context.",
                     violations.join(", ")
