--- src/evaluator.rs
+++ replace == with != in AdmissibilityEvaluator::aggregate
@@ -392,17 +392,17 @@
                 Some(format!(
                     "Your response violates normative axioms: {}. Please revise or refuse to answer if you lack required context.",
                     violations.join(", ")
                 )),
                 format!("Violated axioms: {violations:?}"),
             )
         } else if axiom_results
             .iter()
-            .any(|r| r.status == EvaluationStatus::IllFormed)
+            .any(|r| r.status != /* ~ changed by cargo-mutants ~ */ EvaluationStatus::IllFormed)
         {
             (
                 EvaluationStatus::IllFormed,
                 false,
                 true,
                 Some(
                     "Your response is structurally ill-formed. Please rephrase with clear subject-predicate statements."
                         .to_string(),
