--- src/evaluator.rs
+++ delete ! in AdmissibilityEvaluator::aggregate
@@ -429,17 +429,17 @@
                 true,
                 true,
                 Some(
                     "Your statements lack required grounding. Consider asking for more context or using conditional phrasing."
                         .to_string(),
                 ),
                 "Statements lack required grounding (A4)".to_string(),
             )
-        } else if !axiom_results.is_empty()
+        } else if  /* ~ changed by cargo-mutants ~ */axiom_results.is_empty()
             && axiom_results
                 .iter()
                 .all(|r| r.status == EvaluationStatus::ConditionallyAcceptable)
         {
             (
                 EvaluationStatus::ConditionallyAcceptable,
                 true,
                 false,
