--- src/evaluator.rs
+++ replace && with || in evaluate
@@ -42,17 +42,17 @@
     LastMessageNotAssistant,
     LastAssistantContentNotString,
     AgentOutputMismatch,
     InvalidJson(String),
     InvalidMessage(String),
 }
 
 pub fn evaluate(input: EvaluateInput) -> Result<AdmissibilityJudgment, EvaluateError> {
-    if input.agent_output.is_none() && input.conversation.is_none() {
+    if input.agent_output.is_none() || /* ~ changed by cargo-mutants ~ */ input.conversation.is_none() {
         return Err(EvaluateError::MissingInput);
     }
 
     let (agent_message, trajectory): (ConversationMessage, Vec<ConversationMessage>) =
         if let Some(conversation) = input.conversation.clone() {
             if conversation.is_empty() {
                 return Err(EvaluateError::InvalidConversation);
             }
