--- src/evaluator.rs
+++ replace != with == in evaluate
@@ -55,17 +55,17 @@
         if let Some(conversation) = input.conversation.clone() {
             if conversation.is_empty() {
                 return Err(EvaluateError::InvalidConversation);
             }
             let last = conversation
                 .last()
                 .cloned()
                 .ok_or(EvaluateError::InvalidConversation)?;
-            if last.role != "assistant" {
+            if last.role == /* ~ changed by cargo-mutants ~ */ "assistant" {
                 return Err(EvaluateError::LastMessageNotAssistant);
             }
 
             if let Some(expected_output) = &input.agent_output {
                 let actual = extract_text_content(last.content.as_ref())?;
                 if &actual != expected_output {
                     return Err(EvaluateError::AgentOutputMismatch);
                 }
