--- src/main.rs
+++ replace print_help with ()
@@ -2,21 +2,17 @@
 use normcore_rs::JsonValue;
 use normcore_rs::coerce_grounds_input;
 use normcore_rs::evaluate;
 use normcore_rs::parse_conversation;
 use normcore_rs::parse_json;
 use normcore_rs::to_pretty_json;
 
 fn print_help() {
-    println!("NormCore CLI.");
-    println!("\nUsage:");
-    println!(
-        "  normcore-rs [--version] [--log-level LEVEL] [-v|-vv] evaluate [--agent-output TEXT] [--conversation JSON] [--grounds JSON]"
-    );
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn main() {
     std::process::exit(run(std::env::args().collect()));
 }
 
 fn run(argv: Vec<String>) -> i32 {
     let args = if argv.is_empty() {
