--- src/main.rs
+++ replace == with != in run
@@ -25,17 +25,17 @@
         argv[1..].to_vec()
     };
 
     if args.is_empty() {
         print_help();
         return 0;
     }
 
-    if args.iter().any(|a| a == "--version") {
+    if args.iter().any(|a| a != /* ~ changed by cargo-mutants ~ */ "--version") {
         println!("{}", env!("CARGO_PKG_VERSION"));
         return 0;
     }
 
     let mut i = 0;
     let mut command = String::new();
     let mut agent_output: Option<String> = None;
     let mut conversation_json: Option<String> = None;
