--- src/main.rs
+++ replace < with <= in run
@@ -36,17 +36,17 @@
     }
 
     let mut i = 0;
     let mut command = String::new();
     let mut agent_output: Option<String> = None;
     let mut conversation_json: Option<String> = None;
     let mut grounds_json: Option<String> = None;
 
-    while i < args.len() {
+    while i <= /* ~ changed by cargo-mutants ~ */ args.len() {
         match args[i].as_str() {
             "--log-level" => {
                 i += 1;
             }
             "-v" | "-vv" => {}
             "evaluate" => {
                 command = "evaluate".to_string();
             }
