--- src/main.rs
+++ delete match arm "--log-level" in run
@@ -38,19 +38,17 @@
     let mut i = 0;
     let mut command = String::new();
     let mut agent_output: Option<String> = None;
     let mut conversation_json: Option<String> = None;
     let mut grounds_json: Option<String> = None;
 
     while i < args.len() {
         match args[i].as_str() {
-            "--log-level" => {
-                i += 1;
-            }
+             /* ~ changed by cargo-mutants ~ */
             "-v" | "-vv" => {}
             "evaluate" => {
                 command = "evaluate".to_string();
             }
             "--agent-output" => {
                 i += 1;
                 if let Some(v) = args.get(i) {
                     agent_output = Some(v.clone());
