--- src/main.rs
+++ delete match arm "evaluate" in run
@@ -42,19 +42,17 @@
     let mut grounds_json: Option<String> = None;
 
     while i < args.len() {
         match args[i].as_str() {
             "--log-level" => {
                 i += 1;
             }
             "-v" | "-vv" => {}
-            "evaluate" => {
-                command = "evaluate".to_string();
-            }
+             /* ~ changed by cargo-mutants ~ */
             "--agent-output" => {
                 i += 1;
                 if let Some(v) = args.get(i) {
                     agent_output = Some(v.clone());
                 } else {
                     eprintln!("error: --agent-output requires value");
                     return 2;
                 }
