--- src/main.rs
+++ delete match arm "--agent-output" in run
@@ -45,25 +45,17 @@
         match args[i].as_str() {
             "--log-level" => {
                 i += 1;
             }
             "-v" | "-vv" => {}
             "evaluate" => {
                 command = "evaluate".to_string();
             }
-            "--agent-output" => {
-                i += 1;
-                if let Some(v) = args.get(i) {
-                    agent_output = Some(v.clone());
-                } else {
-                    eprintln!("error: --agent-output requires value");
-                    return 2;
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             "--conversation" => {
                 i += 1;
                 if let Some(v) = args.get(i) {
                     conversation_json = Some(v.clone());
                 } else {
                     eprintln!("error: --conversation requires value");
                     return 2;
                 }
