--- src/main.rs
+++ replace += with -= in run
@@ -46,17 +46,17 @@
             "--log-level" => {
                 i += 1;
             }
             "-v" | "-vv" => {}
             "evaluate" => {
                 command = "evaluate".to_string();
             }
             "--agent-output" => {
-                i += 1;
+                i -= /* ~ changed by cargo-mutants ~ */ 1;
                 if let Some(v) = args.get(i) {
                     agent_output = Some(v.clone());
                 } else {
                     eprintln!("error: --agent-output requires value");
                     return 2;
                 }
             }
             "--conversation" => {
