--- src/main.rs
+++ replace += with -= in run
@@ -55,17 +55,17 @@
                 if let Some(v) = args.get(i) {
                     agent_output = Some(v.clone());
                 } else {
                     eprintln!("error: --agent-output requires value");
                     return 2;
                 }
             }
             "--conversation" => {
-                i += 1;
+                i -= /* ~ changed by cargo-mutants ~ */ 1;
                 if let Some(v) = args.get(i) {
                     conversation_json = Some(v.clone());
                 } else {
                     eprintln!("error: --conversation requires value");
                     return 2;
                 }
             }
             "--grounds" => {
