--- src/main.rs
+++ replace += with -= in run
@@ -64,17 +64,17 @@
                 if let Some(v) = args.get(i) {
                     conversation_json = Some(v.clone());
                 } else {
                     eprintln!("error: --conversation requires value");
                     return 2;
                 }
             }
             "--grounds" => {
-                i += 1;
+                i -= /* ~ changed by cargo-mutants ~ */ 1;
                 if let Some(v) = args.get(i) {
                     grounds_json = Some(v.clone());
                 } else {
                     eprintln!("error: --grounds requires value");
                     return 2;
                 }
             }
             _ => {}
