--- src/main.rs
+++ replace += with *= in run
@@ -74,17 +74,17 @@
                     grounds_json = Some(v.clone());
                 } else {
                     eprintln!("error: --grounds requires value");
                     return 2;
                 }
             }
             _ => {}
         }
-        i += 1;
+        i *= /* ~ changed by cargo-mutants ~ */ 1;
     }
 
     if command != "evaluate" {
         print_help();
         return 0;
     }
 
     let conversation = match conversation_json {
