--- src/main.rs
+++ replace != with == in run
@@ -77,17 +77,17 @@
                     return 2;
                 }
             }
             _ => {}
         }
         i += 1;
     }
 
-    if command != "evaluate" {
+    if command == /* ~ changed by cargo-mutants ~ */ "evaluate" {
         print_help();
         return 0;
     }
 
     let conversation = match conversation_json {
         Some(raw) => match parse_json(&raw) {
             Ok(JsonValue::Array(arr)) => match parse_conversation(&arr) {
                 Ok(v) => Some(v),
